// 과목 리스트
export const subjectList = [
	{
		curriculum: '국어',
		subject: [
			'국어 (1학년 공통국어)',
			'독서',
			'문학',
			'화법과 작문',
			'언어와 매체',
		],
	},
	{
		curriculum: '수학',
		subject: ['수학', '수학Ⅰ', '수학Ⅱ', '미적분', '확률과 통계', '기하'],
	},
	{
		curriculum: '영어',
		subject: ['영어Ⅰ', '영어Ⅱ', '영어회화', '영어독해와 작문'],
	},
	{
		curriculum: '사탐(사회)',
		subject: [
			'통합사회',
			'생활과 윤리',
			'윤리와 사상',
			'사회문화',
			'정치와법',
			'동아시아사',
			'세계사',
			'한국지리',
			'세계지리',
			'경제',
		],
	},
	{
		curriculum: '과탐(과학)',
		subject: [
			'통합과학',
			'과학탐구실험',
			'물리Ⅰ',
			'물리Ⅱ',
			'화학Ⅰ',
			'화학Ⅱ',
			'생명과학Ⅰ',
			'생명과학Ⅱ',
			'지구과학Ⅰ',
			'지구과학Ⅱ',
		],
	},
	{
		curriculum: '한국사',
		subject: [],
	},
	{
		curriculum: '정보',
		subject: [],
	},
	{
		curriculum: '인공지능기초',
		subject: [],
	},
]
